### [ DataFrame 인덱스 다루기 ]

- 새로운 인덱스 설정 : 컬럼 ===> 설정

#### (1) 모듈 로딩

In [1]:
import pandas as pd

#### (2) 데이터 준비

In [2]:
# dict 타입의 데이터 생성
exam = {'이름' : ['마징가', '배트맨', '홍길동', '임꺽정'],
       '국어' : [98, 79, 99, 100],
       '미술' : [70, 99, 87, 80],
       '수학' : [80, 79, 99, 72],
       '체육' : [80, 93, 69, 91],
       '영어' : [40, 50, 60, 70]}

#### (3) 데이터 저장

In [3]:
examDF = pd.DataFrame(exam)

#### (4) 데이터 확인

In [4]:
examDF

    이름   국어  미술  수학  체육  영어
0  마징가   98  70  80  80  40
1  배트맨   79  99  79  93  50
2  홍길동   99  87  99  69  60
3  임꺽정  100  80  72  91  70

 - 행 데이터 추가

In [5]:
# 마징가 98 70 98 80 40
examDF.loc[4] = ['마징가', 98, 72, 70, 83, 55]

In [6]:
# 마징가 98 70 80 80 40
examDF.loc[5] = ['마징가', 91, 78, 70, 86, 60]

#### (5) 새로운 인덱스 설정 - 방법 3 : 멀티인덱스 제어 DF.set_index([컬럼1, 컬럼2, ......, 컬럼n])

In [7]:
# 이름, 국어, 수학을 인덱스 설정
examDF1 = examDF.set_index(['이름', '국어', '수학'])
examDF1

            미술  체육  영어
이름  국어  수학
마징가 98  80  70  80  40
배트맨 79  79  99  93  50
홍길동 99  99  87  69  60
임꺽정 100 72  80  91  70
마징가 98  70  72  83  55
    91  70  78  86  60

In [8]:
# 인덱스 속성 확인
examDF1.index

MultiIndex([('마징가',  98, 80),
            ('배트맨',  79, 79),
            ('홍길동',  99, 99),
            ('임꺽정', 100, 72),
            ('마징가',  98, 70),
            ('마징가',  91, 70)],
           names=['이름', '국어', '수학'])

- 행 데이터 선택 : DF객체변수명.loc[행레이블] / DF객체변수명.iloc[위치인덱스]

In [9]:
examDF1.loc[('마징가', 98, 80)]

미술    70
체육    80
영어    40
Name: (마징가, 98, 80), dtype: int64

In [10]:
examDF1.loc[('마징가', 98, 70)]

미술    72
체육    83
영어    55
Name: (마징가, 98, 70), dtype: int64

In [18]:
examDF1.loc[('마징가', 98, 70)]

미술    72
체육    83
영어    55
Name: (마징가, 98, 70), dtype: int64

In [ ]:
# keyError 발생
# examDF1.loc[(98)]

- 멀티인덱스의 인덱스의 일부분을 기준으로 행 선택 : xs   
    예) '마징가', 98, 60

In [19]:
examDF1.xs('마징가')  # == examDF1.xs('마징가', level = 0)

       미술  체육  영어
국어 수학
98 80  70  80  40
   70  72  83  55
91 70  78  86  60

In [21]:
examDF1.xs(98, level = 1)  # == examDF1.xs('마징가', level = 0)

        미술  체육  영어
이름  수학
마징가 80  70  80  40
    70  72  83  55

In [20]:
examDF1.xs(80, level = 2)

        미술  체육  영어
이름  국어
마징가 98  70  80  40

In [16]:
examDF1.xs(70, level = 2)

        미술  체육  영어
이름  국어
마징가 98  72  83  55
    91  78  86  60

- ('마징가', 98, 80), ('임꺽정', 100, 72) 2개 행을 한꺼번에 가져오기

In [39]:
examDF1.loc[[('마징가', 98, 80), ('임꺽정', 100, 72)]]

            미술  체육  영어
이름  국어  수학
마징가 98  80  70  80  40
임꺽정 100 72  80  91  70

In [15]:
# 인덱스 하나를 리스트에 넣어서 출력했으므로 타입은 데이터 프레임, 만약 리스트 없이 출력하면 시리즈이다.
examDF1.loc[[('마징가', 98, 80)]]

           미술  체육  영어
이름  국어 수학
마징가 98 80  70  80  40

#### (5) 인덱스 재정렬 : 행/열 인덱스를 원하는 순서대로 재배치 + 존재하지 않는 행/열 추가
- DF.reindex()

In [41]:
print(examDF.index, examDF.columns, sep = '\n\n')

Index([0, 1, 2, 3, 4, 5], dtype='int64')

Index(['이름', '국어', '미술', '수학', '체육', '영어'], dtype='object')

- 컬럼명 순서 변경 ==> '체육', '미술', '국어', '수학', '영어'

In [44]:
examDF.reindex(['체육', '미술', '국어', '수학', '영어', '총합'], axis = 'columns', fill_value = 0)

   체육  미술   국어  수학  영어  총합
0  80  70   98  80  40   0
1  93  99   79  79  50   0
2  69  87   99  99  60   0
3  91  80  100  72  70   0
4  83  72   98  70  55   0
5  86  78   91  70  60   0

* 행 인덱스 재배치

In [46]:
examDF.reindex([0, 2, 4, 1, 3, 5], axis = 'index', fill_value = 0)

    이름   국어  미술  수학  체육  영어
0  마징가   98  70  80  80  40
2  홍길동   99  87  99  69  60
4  마징가   98  72  70  83  55
1  배트맨   79  99  79  93  50
3  임꺽정  100  80  72  91  70
5  마징가   91  78  70  86  60

* 컬럼명 순서 변경 ==> '체육', '미술', '국어', '순서', '총합], fill_value = 0)

In [47]:
examDF.reindex(index = [0, 2, 4, 1, 3, 5], columns = ['체육', '미술', '국어', '수학', '총합'], fill_value = 0)

   체육  미술   국어  수학  총합
0  80  70   98  80   0
2  69  87   99  99   0
4  83  72   98  70   0
1  93  99   79  79   0
3  91  80  100  72   0
5  86  78   91  70   0